# 1. Сложение чисел: Посчитайте и выведите сумму чисел 7 и 15.
print(7+15)
# 2. Вычислите разность чисел 25 и 10 и выведите результат.
print(25-10)
# 3. Умножение чисел: Вычислите произведение чисел 6 и 8 и выведите результат.
print(6*8)
# 4. Деление: Поделите число 20 на 4 и выведите результат.
print(20/4)
# 5. Комбинация операций: Вычислите результат выражения (10 + 5) * 2 и выведите его.
print((10+5)*2)
# 6. Остаток от деления: Найдите остаток от деления числа 17 на 3 и выведите результат.
print(17%3)
# 7. Выражение с несколькими операциями: Вычислите значение выражения (15 - 3) *(2 + 4) / 6 и выведите результат.
print((15-3)*(2+4)/6)
# 8. Работа с дробями: Поделите число 22 на 7 и выведите результат как десятичное число.
print(22/7)
# 9. Сложное выражение: Вычислите результат выражения (10 + 20) / 5 + 3 * (8 -2) и выведите результат.
print((10+20)/5+3*(8-2))
# 10. Операции со скобками: Посчитайте значение выражения 100 - (30 / (2 +3)) * 4 + 10 и выведите его.
print(100-(30/(2+3))*4+10)


